#+title: Log timeblock
** Visualization/Rendering Example: Using timeblock.el directly
#+begin_src elisp
;; Example with multiple days, each with its own column, and a custom keymap (q quits buffer).
;; (Follows timeblock-example.el usage for :keymap)
(require 'timeblock)
(let ((buf (get-buffer-create "*timeblock-demo*")))
  (with-current-buffer buf
    (erase-buffer)
    (let ((demo-keymap (let ((map (make-sparse-keymap)))
                        (define-key map (kbd "q")
                          (lambda () (interactive) (kill-buffer)))
                        map)))
      ;; Day 1
      (let* ((date1 (parse-time-string "2024-11-08 00:00"))
             (entries1
              (list
               (list (cons 'start (parse-time-string "2024-11-08 10:00"))
                     (cons 'end (parse-time-string "2024-11-08 14:30"))
                     (cons 'title "Block 1"))
               (list (cons 'start (parse-time-string "2024-11-08 14:00"))
                     (cons 'end (parse-time-string "2024-11-08 15:00"))
                     (cons 'title "Block 2"))
               (list (cons 'start (parse-time-string "2024-11-08"))
                     (cons 'end nil)
                     (cons 'title "All-day Block")))))
        (timeblock-insert-column
         entries1 date1 200 (window-pixel-height)
         :show-date t :show-all-day-entries t :show-current-time t
         :keymap demo-keymap))
      ;; Day 2
      (let* ((date2 (parse-time-string "2025-09-16 Tue 00:00"))
             (entries2
              (list
               (list (cons 'start (parse-time-string "2025-09-16 Tue 09:15"))
                     (cons 'end (parse-time-string "2025-09-16 Tue 10:30"))
                     (cons 'title "Block A"))
               (list (cons 'start (parse-time-string "2025-09-16 Tue 13:00"))
                     (cons 'end (parse-time-string "2025-09-16 Tue 14:15"))
                     (cons 'title "Block B")))))
        (timeblock-insert-column
         entries2 date2 200 (window-pixel-height)
         :show-date t :show-all-day-entries t :show-time t :show-current-time t
         :keymap demo-keymap))
      (goto-char (point-min))))
  (pop-to-buffer buf))

#+end_src

#+RESULTS:
: #<buffer *timeblock-demo*>

** Prototype: Clickable Timeblock Logging Example

#+begin_src elisp
;; Prototype: Minimal clickable timeblocks example.
(require 'timeblock)

(let* ((buf (get-buffer-create "*timeblock-click-demo*"))
       (entries
        (list (list (cons 'start (parse-time-string "2024-11-08 10:00"))
                    (cons 'end (parse-time-string "2024-11-08 11:00"))
                    (cons 'title "Demo Task A")
                    (cons 'file "/tmp/fake1.org")
                    (cons 'point 1111))
              (list (cons 'start (parse-time-string "2024-11-08 12:00"))
                    (cons 'end (parse-time-string "2024-11-08 13:00"))
                    (cons 'title "Demo Task B")
                    (cons 'file "/tmp/fake2.org")
                    (cons 'point 2222)))))
  (with-current-buffer buf
    (erase-buffer)
    (let ((map (let ((m (make-sparse-keymap)))
                (define-key m [mouse-1]
                  (lambda () (interactive)
                    (let ((file (get-text-property (point) :file))
                          (pos (get-text-property (point) :point)))
                      (message "Clicked block for file=%s point=%s" file pos))))
                (define-key m (kbd "RET")
                  (lambda () (interactive)
                    (let ((file (get-text-property (point) :file))
                          (pos (get-text-property (point) :point)))
                      (message "Clicked block for file=%s point=%s" file pos))))
                m)))
      (timeblock-insert-column
       entries (parse-time-string "2024-11-08 00:00") 200 (window-pixel-height)
       :keymap map))
    (goto-char (point-min)))
  (pop-to-buffer buf))
#+end_src

#+RESULTS:
: #<buffer *timeblock-click-demo*>


